2019/changements-2018-2019.org
#+title: Listes des changements entre le SILL 2018 et le SILL 2019

* SILL PROD

** Entrées et sorties

- Nouvelles entrées :
  - Keycloak : version 4
  - Kubernetes : version distribution

- Passage en recommandé :
  - Jitsi : version distribution

- Passage en fin de recommandation :
  - Aucune

** Montées de version

| LOGICIEL               | 2018 |  2019 |
|------------------------+------+-------|
| PostgreSQL             |  9.5 |    10 |
| MariaDB                | 10.1 |  10.3 |
| CockroachDB            |      |     2 |
| ElasticSearch          |  5.6 |   6.X |
| CentOS (souche Redhat) |  7.4 |   7.6 |
| Ubuntu – Eole          |  2.6 |   2.7 |
| Debian                 |    8 |     9 |
| OpenNebula             |  5.4 |   5.6 |
| Shinken                |      | 2.4.3 |
| Samba 4                |  4.7 |   4.9 |
| KEYCLOAK               |      |     4 |
| logstash / kibana      |  5.6 |   6.X |
| Eole AMON              |  2.6 |   2.7 |
    
* SILL DEV

** Entrées et sorties

- Nouvelles entrées :
  - Assistant RGAA 
    - Cas d'usage : pour le poste de travail des agents impliqués dans
      le cycle de vie d’une application utilisée via un navigateur web
    - Version : 1.0.4
    - Porteur : DINSIC
  - ARX Data Anonymization Tool
    - Version : 3.7.1
    - Porteur : MIMDEV

- Fin de recommandation :
  - PENCIL
  - Fitnesse
  - DBFit
  - PhpBB

- Passage en recommandé :
  - Chromium

** Montées de versions

| LOGICIEL                                        |    2018 |    2019 |
|-------------------------------------------------+---------+---------|
| Acceleo                                         |   3.7.2 |   3.7.4 |
| ARX Data Anonymization Tool                     |     N/A |   3.7.1 |
| CodeceptJS                                      |     N/A |   2.0.4 |
| Eclipse                                         |     4.7 |     4.9 |
| GitLab Community Edition                        |  9.0.10 |    11.X |
| H2                                              | 1.4.196 | 1.4.197 |
| Jacoco                                          |   0.7.9 |   0.8.2 |
| Jailer                                          |   5.5.2 |   8.2.X |
| Javamelody                                      |     1.7 |  1.74.0 |
| Jmeter                                          |     3.1 |     5.0 |
| Junit                                           |    4.12 |     5.2 |
| Npm                                             |    3.10 |      C* |
| Selenium IDE                                    |     2.9 |     3.4 |
| Selenium Server                                 |       3 |     3.X |
| Serveur NodeJS                                  |     6.X |       8 |
| SoapUI                                          |   5.2.X |   5.4.0 |
| SonarQube Plugins : FindBugs CheckStyle Pmd     |     6.3 |     6.7 |
| Spring Boot                                     |   1.5.8 |     2.X |
| Squash TA                                       |  1.10.1 |    1.11 |
| Squash TM                                       |  1.14.0 |  1.17.1 |
| Talend Open Studio for Data Integration (BASIC) |   6.3.X |   7.0.1 |
| Tanaguru                                        |   4.0.3 |   5.0.3 |
| Tomcat                                          |     7.X |     9.0 |
| Yarn                                            |   1.3.2 |  1.12.3 |

C* = Dernière version compatible avec le nodeJS préconisé.

* SILL Office

** Entrées et sorties

*** En recommandation

- *VRT network equipment* (LibreOffice)
  - Fonctionnalité : galerie d’images
  - Version 1.2
- *LireCouleur* (LibreOffice)
  - Fonctionnalité : ensemble d’outils destiné à aider les lecteurs
    débutants ou en difficulté à décoder les mots en utilisant les
    principes de la lecture en couleur
  - version 4.7
- *OBS Studio*
  - Fonctionnalité : captation vidéo et flux

*** En observation

- *Draw.io Desktop*
  - Fonctionnalité : schémas
  - Version : 9.3
- *WAPT*
  - Fonctionnalité : Déploiement, mise à jour et suppression des
    logiciels et des configurations sur un parc Windows
  - Version : 1.6 Community
- *GLPI*
  - Fonctionnalité : Plugin GLPI-Survey (questionnaire)
  - Version : 9.3.1.0
- *K-9 Mail*
  - Fonctionnalité : Courrielleur pour Android
  - Version : 5.600
- *WEBACCESS* (NVDA)
  - Fonctionnalité : Outil de dev pour l’accessibilité
  - Version : 2018.10.10
- *assistant_rga* (Firefox)
  - Fonctionnalité : Outil de test de compatibilité RGAOutil de test accessibilité
  - Version 1.0.4
- *Wekan*
  - Fonctionnalité : gestion de tâches
- *Framadate*
  - Fonctionnalité : Rendez-vous
- *Limesurvey*
  - Fonctionnalité : enquête
- *NextCloud*
  - Fonctionnalité : partage de fichiers
- *MediaWiki*
  - Fonctionnalité : wiki
- *Rocketchat*
  - Fonctionnalité : messagerie instantanée
- *Mastodon*
  - Fonctionnalité : microblogue
- *uMap.OpenStreetMap*
  - Fonctionnalité : informations géographiques
- *LibreOffice en ligne*
  - Fonctionnalité : rédaction collaborative
- *Discourse*
  - Fonctionnalité : forum
- *Drupal*
  - Fonctionnalité : gestion de contenu web
- *Wordpress*
  - Fonctionnalité : blogue
- *Sympa*
  - Fonctionnalité : liste de diffusion/discussion

