2019/changements-2018-2019.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-03-12 mar. 22:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Listes des changements entre le SILL 2018 et le SILL 2019</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bastien" />
</head>
<body>
<div id="content">
<h1 class="title">Listes des changements entre le SILL 2018 et le SILL 2019</h1>

<div id="outline-container-org34b01ec" class="outline-2">
<h2 id="org34b01ec">SILL PROD</h2>
<div class="outline-text-2" id="text-org34b01ec">
</div>
<div id="outline-container-org97546d7" class="outline-3">
<h3 id="org97546d7">Entrées et sorties</h3>
<div class="outline-text-3" id="text-org97546d7">
<ul class="org-ul">
<li>Nouvelles entrées :
<ul class="org-ul">
<li>Keycloak : version 4</li>
<li>Kubernetes : version distribution</li>
</ul></li>

<li>Passage en recommandé :
<ul class="org-ul">
<li>Jitsi : version distribution</li>
</ul></li>

<li>Passage en fin de recommandation :
<ul class="org-ul">
<li>Aucune</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcf1772f" class="outline-3">
<h3 id="orgcf1772f">Montées de version</h3>
<div class="outline-text-3" id="text-orgcf1772f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">LOGICIEL</th>
<th scope="col" class="org-right">2018</th>
<th scope="col" class="org-right">2019</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PostgreSQL</td>
<td class="org-right">9.5</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">MariaDB</td>
<td class="org-right">10.1</td>
<td class="org-right">10.3</td>
</tr>

<tr>
<td class="org-left">CockroachDB</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">ElasticSearch</td>
<td class="org-right">5.6</td>
<td class="org-right">6.X</td>
</tr>

<tr>
<td class="org-left">CentOS (souche Redhat)</td>
<td class="org-right">7.4</td>
<td class="org-right">7.6</td>
</tr>

<tr>
<td class="org-left">Ubuntu – Eole</td>
<td class="org-right">2.6</td>
<td class="org-right">2.7</td>
</tr>

<tr>
<td class="org-left">Debian</td>
<td class="org-right">8</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-left">OpenNebula</td>
<td class="org-right">5.4</td>
<td class="org-right">5.6</td>
</tr>

<tr>
<td class="org-left">Shinken</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">2.4.3</td>
</tr>

<tr>
<td class="org-left">Samba 4</td>
<td class="org-right">4.7</td>
<td class="org-right">4.9</td>
</tr>

<tr>
<td class="org-left">KEYCLOAK</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">logstash / kibana</td>
<td class="org-right">5.6</td>
<td class="org-right">6.X</td>
</tr>

<tr>
<td class="org-left">Eole AMON</td>
<td class="org-right">2.6</td>
<td class="org-right">2.7</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgc234483" class="outline-2">
<h2 id="orgc234483">SILL DEV</h2>
<div class="outline-text-2" id="text-orgc234483">
</div>
<div id="outline-container-org9b0c7f8" class="outline-3">
<h3 id="org9b0c7f8">Entrées et sorties</h3>
<div class="outline-text-3" id="text-org9b0c7f8">
<ul class="org-ul">
<li>Nouvelles entrées :
<ul class="org-ul">
<li>Assistant RGAA 
<ul class="org-ul">
<li>Cas d'usage : pour le poste de travail des agents impliqués dans
le cycle de vie d’une application utilisée via un navigateur web</li>
<li>Version : 1.0.4</li>
<li>Porteur : DINSIC</li>
</ul></li>
<li>ARX Data Anonymization Tool
<ul class="org-ul">
<li>Version : 3.7.1</li>
<li>Porteur : MIMDEV</li>
</ul></li>
</ul></li>

<li>Fin de recommandation :
<ul class="org-ul">
<li>PENCIL</li>
<li>Fitnesse</li>
<li>DBFit</li>
<li>PhpBB</li>
</ul></li>

<li>Passage en recommandé :
<ul class="org-ul">
<li>Chromium</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4ba9d9f" class="outline-3">
<h3 id="org4ba9d9f">Montées de versions</h3>
<div class="outline-text-3" id="text-org4ba9d9f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">LOGICIEL</th>
<th scope="col" class="org-right">2018</th>
<th scope="col" class="org-right">2019</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Acceleo</td>
<td class="org-right">3.7.2</td>
<td class="org-right">3.7.4</td>
</tr>

<tr>
<td class="org-left">ARX Data Anonymization Tool</td>
<td class="org-right">N/A</td>
<td class="org-right">3.7.1</td>
</tr>

<tr>
<td class="org-left">CodeceptJS</td>
<td class="org-right">N/A</td>
<td class="org-right">2.0.4</td>
</tr>

<tr>
<td class="org-left">Eclipse</td>
<td class="org-right">4.7</td>
<td class="org-right">4.9</td>
</tr>

<tr>
<td class="org-left">GitLab Community Edition</td>
<td class="org-right">9.0.10</td>
<td class="org-right">11.X</td>
</tr>

<tr>
<td class="org-left">H2</td>
<td class="org-right">1.4.196</td>
<td class="org-right">1.4.197</td>
</tr>

<tr>
<td class="org-left">Jacoco</td>
<td class="org-right">0.7.9</td>
<td class="org-right">0.8.2</td>
</tr>

<tr>
<td class="org-left">Jailer</td>
<td class="org-right">5.5.2</td>
<td class="org-right">8.2.X</td>
</tr>

<tr>
<td class="org-left">Javamelody</td>
<td class="org-right">1.7</td>
<td class="org-right">1.74.0</td>
</tr>

<tr>
<td class="org-left">Jmeter</td>
<td class="org-right">3.1</td>
<td class="org-right">5.0</td>
</tr>

<tr>
<td class="org-left">Junit</td>
<td class="org-right">4.12</td>
<td class="org-right">5.2</td>
</tr>

<tr>
<td class="org-left">Npm</td>
<td class="org-right">3.10</td>
<td class="org-right">C*</td>
</tr>

<tr>
<td class="org-left">Selenium IDE</td>
<td class="org-right">2.9</td>
<td class="org-right">3.4</td>
</tr>

<tr>
<td class="org-left">Selenium Server</td>
<td class="org-right">3</td>
<td class="org-right">3.X</td>
</tr>

<tr>
<td class="org-left">Serveur NodeJS</td>
<td class="org-right">6.X</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">SoapUI</td>
<td class="org-right">5.2.X</td>
<td class="org-right">5.4.0</td>
</tr>

<tr>
<td class="org-left">SonarQube Plugins : FindBugs CheckStyle Pmd</td>
<td class="org-right">6.3</td>
<td class="org-right">6.7</td>
</tr>

<tr>
<td class="org-left">Spring Boot</td>
<td class="org-right">1.5.8</td>
<td class="org-right">2.X</td>
</tr>

<tr>
<td class="org-left">Squash TA</td>
<td class="org-right">1.10.1</td>
<td class="org-right">1.11</td>
</tr>

<tr>
<td class="org-left">Squash TM</td>
<td class="org-right">1.14.0</td>
<td class="org-right">1.17.1</td>
</tr>

<tr>
<td class="org-left">Talend Open Studio for Data Integration (BASIC)</td>
<td class="org-right">6.3.X</td>
<td class="org-right">7.0.1</td>
</tr>

<tr>
<td class="org-left">Tanaguru</td>
<td class="org-right">4.0.3</td>
<td class="org-right">5.0.3</td>
</tr>

<tr>
<td class="org-left">Tomcat</td>
<td class="org-right">7.X</td>
<td class="org-right">9.0</td>
</tr>

<tr>
<td class="org-left">Yarn</td>
<td class="org-right">1.3.2</td>
<td class="org-right">1.12.3</td>
</tr>
</tbody>
</table>

<p>
C* = Dernière version compatible avec le nodeJS préconisé.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb88f49c" class="outline-2">
<h2 id="orgb88f49c">SILL Office</h2>
<div class="outline-text-2" id="text-orgb88f49c">
</div>
<div id="outline-container-org8ad7a74" class="outline-3">
<h3 id="org8ad7a74">Entrées et sorties</h3>
<div class="outline-text-3" id="text-org8ad7a74">
</div>
<div id="outline-container-org98714e8" class="outline-4">
<h4 id="org98714e8">En recommandation</h4>
<div class="outline-text-4" id="text-org98714e8">
<ul class="org-ul">
<li><b>VRT network equipment</b> (LibreOffice)
<ul class="org-ul">
<li>Fonctionnalité : galerie d’images</li>
<li>Version 1.2</li>
</ul></li>
<li><b>LireCouleur</b> (LibreOffice)
<ul class="org-ul">
<li>Fonctionnalité : ensemble d’outils destiné à aider les lecteurs
débutants ou en difficulté à décoder les mots en utilisant les
principes de la lecture en couleur</li>
<li>version 4.7</li>
</ul></li>
<li><b>OBS Studio</b>
<ul class="org-ul">
<li>Fonctionnalité : captation vidéo et flux</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9759b39" class="outline-4">
<h4 id="org9759b39">En observation</h4>
<div class="outline-text-4" id="text-org9759b39">
<ul class="org-ul">
<li><b>Draw.io Desktop</b>
<ul class="org-ul">
<li>Fonctionnalité : schémas</li>
<li>Version : 9.3</li>
</ul></li>
<li><b>WAPT</b>
<ul class="org-ul">
<li>Fonctionnalité : Déploiement, mise à jour et suppression des
logiciels et des configurations sur un parc Windows</li>
<li>Version : 1.6 Community</li>
</ul></li>
<li><b>GLPI</b>
<ul class="org-ul">
<li>Fonctionnalité : Plugin GLPI-Survey (questionnaire)</li>
<li>Version : 9.3.1.0</li>
</ul></li>
<li><b>K-9 Mail</b>
<ul class="org-ul">
<li>Fonctionnalité : Courrielleur pour Android</li>
<li>Version : 5.600</li>
</ul></li>
<li><b>WEBACCESS</b> (NVDA)
<ul class="org-ul">
<li>Fonctionnalité : Outil de dev pour l’accessibilité</li>
<li>Version : 2018.10.10</li>
</ul></li>
<li><b>assistant_rga</b> (Firefox)
<ul class="org-ul">
<li>Fonctionnalité : Outil de test de compatibilité RGAOutil de test accessibilité</li>
<li>Version 1.0.4</li>
</ul></li>
<li><b>Wekan</b>
<ul class="org-ul">
<li>Fonctionnalité : gestion de tâches</li>
</ul></li>
<li><b>Framadate</b>
<ul class="org-ul">
<li>Fonctionnalité : Rendez-vous</li>
</ul></li>
<li><b>Limesurvey</b>
<ul class="org-ul">
<li>Fonctionnalité : enquête</li>
</ul></li>
<li><b>NextCloud</b>
<ul class="org-ul">
<li>Fonctionnalité : partage de fichiers</li>
</ul></li>
<li><b>MediaWiki</b>
<ul class="org-ul">
<li>Fonctionnalité : wiki</li>
</ul></li>
<li><b>Rocketchat</b>
<ul class="org-ul">
<li>Fonctionnalité : messagerie instantanée</li>
</ul></li>
<li><b>Mastodon</b>
<ul class="org-ul">
<li>Fonctionnalité : microblogue</li>
</ul></li>
<li><b>uMap.OpenStreetMap</b>
<ul class="org-ul">
<li>Fonctionnalité : informations géographiques</li>
</ul></li>
<li><b>LibreOffice en ligne</b>
<ul class="org-ul">
<li>Fonctionnalité : rédaction collaborative</li>
</ul></li>
<li><b>Discourse</b>
<ul class="org-ul">
<li>Fonctionnalité : forum</li>
</ul></li>
<li><b>Drupal</b>
<ul class="org-ul">
<li>Fonctionnalité : gestion de contenu web</li>
</ul></li>
<li><b>Wordpress</b>
<ul class="org-ul">
<li>Fonctionnalité : blogue</li>
</ul></li>
<li><b>Sympa</b>
<ul class="org-ul">
<li>Fonctionnalité : liste de diffusion/discussion</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Bastien</p>
<p class="date">Created: 2019-03-12 mar. 22:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
